janxxx/pic24-timer1/configurationBits.h
/*
 * File:       configurationBits.h
 * Author:     Jan Abramowicz
 * Last edit:  2022/04/19 (YYYY/MM/DD)
 */

// This is a guard condition so that contents of this file are not included
// more than once.  
#ifndef XC_HEADER_TEMPLATE_H

    #define	XC_HEADER_TEMPLATE_H
    #include <xc.h>  

    // PIC24FJ128GA202 Configuration Bit Settings
    // Everything unnecessary is disabled

    // CONFIG4
    #pragma config DSWDTPS = DSWDTPS1F      // Deep Sleep Watchdog Timer Postscale Select bits (1:68719476736 (25.7 Days))
    #pragma config DSWDTOSC = LPRC          // DSWDT Reference Clock Select (DSWDT uses LPRC as reference clock)
    #pragma config DSBOREN = OFF            // Deep Sleep BOR Enable bit (DSBOR Disabled)
    #pragma config DSWDTEN = OFF            // Deep Sleep Watchdog Timer Enable (DSWDT Disabled)
    #pragma config DSSWEN = OFF             // DSEN Bit Enable (Deep Sleep operation is always disabled)
    #pragma config PLLDIV = DISABLED        // USB 96 MHz PLL Prescaler Select bits (PLL Disabled)
    #pragma config I2C1SEL = DISABLE        // Alternate I2C1 enable bit (I2C1 uses SCL1 and SDA1 pins)
    #pragma config IOL1WAY = ON             // PPS IOLOCK Set Only Once Enable bit (Once set, the IOLOCK bit cannot be cleared)

    // CONFIG3
    #pragma config WPFP = WPFP127           // Write Protection Flash Page Segment Boundary (Page 127 (0x1FC00))
    #pragma config SOSCSEL = ON             // SOSC Selection bits (SOSC circuit selected)
    #pragma config WDTWIN = PS25_0          // Window Mode Watchdog Timer Window Width Select (Watch Dog Timer Window Width is 25 percent)
    #pragma config PLLSS = PLL_PRI          // PLL Secondary Selection Configuration bit (PLL is fed by the Primary oscillator)
    #pragma config BOREN = OFF              // Brown-out Reset Enable (Brown-out Reset Disabled)
    #pragma config WPDIS = WPDIS            // Segment Write Protection Disable (Disabled)
    #pragma config WPCFG = WPCFGDIS         // Write Protect Configuration Page Select (Disabled)
    #pragma config WPEND = WPENDMEM         // Segment Write Protection End Page Select (Write Protect from WPFP to the last page of memory)

    // CONFIG2
    #pragma config POSCMD = XT              // Primary Oscillator Select (XT Oscillator Enabled)
    #pragma config WDTCLK = LPRC            // WDT Clock Source Select bits (WDT uses LPRC)
    #pragma config OSCIOFCN = OFF           // OSCO Pin Configuration (OSCO/CLKO/RA3 functions as CLKO (FOSC/2))
    #pragma config FCKSM = CSDCMD           // Clock Switching and Fail-Safe Clock Monitor Configuration bits (Clock switching and Fail-Safe Clock Monitor are disabled)
    #pragma config FNOSC = PRI              // Initial Oscillator Select (Primary Oscillator (XT, HS, EC))
    #pragma config ALTCMPI = CxINC_RB       // Alternate Comparator Input bit (C1INC is on RB13, C2INC is on RB9 and C3INC is on RA0)
    #pragma config WDTCMX = WDTCLK          // WDT Clock Source Select bits (WDT clock source is determined by the WDTCLK Configuration bits)
    #pragma config IESO = ON                // Internal External Switchover (Enabled)

    // CONFIG1
    #pragma config WDTPS = PS32768          // Watchdog Timer Postscaler Select (1:32,768)
    #pragma config FWPSA = PR128            // WDT Prescaler Ratio Select (1:128)
    #pragma config WINDIS = OFF             // Windowed WDT Disable (Standard Watchdog Timer)
    #pragma config FWDTEN = OFF             // Watchdog Timer Enable (WDT disabled in hardware; SWDTEN bit disabled)
    #pragma config ICS = PGx1               // Emulator Pin Placement Select bits (Emulator functions are shared with PGEC1/PGED1)
    #pragma config LPCFG = OFF              // Low power regulator control (Disabled - regardless of RETEN)
    #pragma config GWRP = OFF               // General Segment Write Protect (Write to program memory allowed)
    #pragma config GCP = OFF                // General Segment Code Protect (Code protection is disabled)
    #pragma config JTAGEN = ON              // JTAG Port Enable (Enabled)

#endif	/* XC_HEADER_TEMPLATE_H */

